#### Pandas
Pandas is a Python package providing fast, flexible, and expressive data structures designed to make working with “relational” or “labeled” data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python.
#### DataFrame
DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects.

#### Imports

In [2]:
import pandas as pd
import numpy as np

#### Creating dataframe from list of tuples

In [36]:
sales_list = [('Jones LLC', 150, 200, 50),
         ('Alpha Co', 200, 210, 90),
         ('Blue Inc', 140, 215, 95)]

In [37]:
type(sales_list)

list

In [38]:
labels = ['account', 'Jan', 'Feb', 'Mar']

In [39]:
df = pd.DataFrame.from_records(sales, columns=labels)

In [40]:
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [41]:
df['account']

0    Jones LLC
1     Alpha Co
2     Blue Inc
Name: account, dtype: object

In [42]:
df[['account', 'Jan']]

     account  Jan
0  Jones LLC  150
1   Alpha Co  200
2   Blue Inc   50

#### Creating dataframe from Dictionaries

In [58]:
sales_dict = {'Account': ['Jones LLC', 'Alpha Co', 'Blue Inc'],
         'Jan': [150, 200, 50],
         'Feb': [200, 210, 90],
         'Mar': [140, 215, 95]}

In [59]:
type(sales_dict)

dict

In [62]:
df_dict = pd.DataFrame.from_dict(sales_dict)

In [63]:
df_dict[:2]

     Account  Feb  Jan  Mar
0  Jones LLC  200  150  140
1   Alpha Co  210  200  215

Pandas Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index. The basic method to create a Series is to cal

The essential difference is the presence of the index: while the Numpy Array has an implicitly defined integer index used to access the values, the Pandas Series has an explicitly defined index associated with the values. This explicit index definition gives the Series object additional capabilities.

In [18]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])

In [20]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [28]:
data.values

array([ 0.25,  0.5 ,  0.75,  1.  ])

In [29]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [31]:
#Like with a NumPy array, data can be accessed by the associated index via the familiar Python square-bracket notation
data[1]

0.5

In [32]:
data[1:3]

1    0.50
2    0.75
dtype: float64

####  Creating dataframe from csv file

In [64]:
titanic_df = pd.read_csv('data/titanic_train.csv')

In [65]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [66]:
titanic_df.columns

Index([u'PassengerId', u'Survived', u'Pclass', u'Name', u'Sex', u'Age',
       u'SibSp', u'Parch', u'Ticket', u'Fare', u'Cabin', u'Embarked'],
      dtype='object')

In [67]:
titanic_df[['Survived','Embarked']][:5]

   Survived Embarked
0         0        S
1         1        C
2         1        S
3         1        S
4         0        S

####  Creating dataframe from tsv file

In [70]:
sentiment_analysis_df = pd.read_csv('data/sentiment_analysis.tsv', sep = '\t')

In [71]:
sentiment_analysis_df.head()

,PhraseId,SentenceId,Phrase,Sentiment
0,1,1,A series of escapades demonstrating the adage ...,1
1,2,1,A series of escapades demonstrating the adage ...,2
2,3,1,A series,2
3,4,1,A,2
4,5,1,series,2

In [72]:
xl = pd.ExcelFile("data/xl_sample_data.xls")

In [73]:
xl.sheet_names

[u'Sheet1', u'Sheet2', u'Sheet3']

In [75]:
sheet1_df = xl.parse("Sheet1")

In [76]:
sheet1_df.head()

,ID,Point,Strain,sex,sex#,age,bodywt,brainwt,MedUNshOB,Res1_sex,Res2_sex-age,Res3_sex-age-bw,Res4_sex-age-bw-brnw
0,169,0.3,B,F,2,189,29.4,495.8,31.976,11.49506,9.57071,9.09569,7.37700
1,171,0.3,B,F,2,51,19.7,474.9,24.772,4.29106,4.92325,4.77891,2.92035
2,232,0.3,B,M,1,294,35.0,476.1,24.836,4.44382,0.57692,0.30106,-0.74414
3,1709,0.3,B,M,1,70,26.0,478.5,22.957,2.56518,3.08886,2.65279,0.89738
4,247,0.4,D,M,1,203,26.7,397.2,20.035,-0.35698,-2.53805,-2.35912,-1.33226

In [77]:
sheet2_df = xl.parse("Sheet2")

####  Creating dataframe from ulr file

In [3]:
data = pd.read_csv('https://s3-eu-west-1.amazonaws.com/shanebucket/downloads/uk-500.csv')

In [4]:
data.head()

,first_name,last_name,company_name,address,city,county,postal,phone1,phone2,email,web
0,Aleshia,Tomkiewicz,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk
1,Evan,Zigomalas,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk
2,France,Andrade,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk
3,Ulysses,Mcwalters,"Mcmahan, Ben L",505 Exeter Rd,Hawerby cum Beesby,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk
4,Tyisha,Veness,Champagne Room,5396 Forth Street,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com,http://www.champagneroom.co.uk

In [42]:
data.to_csv("data/uk-500.csv")

#### Saving dataframe as csv file

In [5]:
import numpy as np

In [6]:
df = pd.DataFrame(np.random.randn(5, 3), columns=list('ABC'))

In [7]:
df

          A         B         C
0  1.222343  0.692369 -1.994886
1 -0.172667 -0.472498  0.317862
2  0.839121 -0.404543 -0.430902
3  0.337590 -0.441059  0.559575
4 -0.284473  2.498569  0.022783

In [87]:
df.to_csv('data/example.csv', index=False)
#df.to_csv('data/example.csv', index=True)
#df.to_csv('example.csv', index=False, header=False)
#df.to_csv('example.csv', index=False, header=False, sep='\t')

#### Simple manipulation of DataFrames

In [77]:
import numpy as np

In [110]:
df = pd.DataFrame(np.random.randn(5, 6), columns=list('ABCDEF'))

In [111]:
print(df)

          A         B         C         D         E         F
0 -1.543191 -0.731146  0.643655  1.454015  0.413386 -0.696252
1 -0.349650  0.341173 -1.098807 -0.116793 -0.064043 -0.404365
2  0.312061  0.475831  1.421632 -0.182307  0.954442  0.715990
3 -0.052700  0.480710 -0.310457 -1.372161 -0.236672 -2.027064
4 -0.140328 -0.565026  0.950586  0.161745 -1.054618 -0.287700

In [100]:
#Using del
del df['C']

In [95]:
print(df)

          A         B         D         E         F
0  0.234767 -0.323556 -1.132881  1.069768 -0.365969
1  0.870469 -1.967456  1.057805  0.538490 -0.566981
2 -0.328008 -0.416518 -1.604881 -0.147345  0.486043
3 -0.044399  1.476384  0.412996 -0.834467 -0.988329
4  0.372571 -0.312810 -0.094334  1.116589  1.068720

In [103]:
df.drop(['B', 'E'], axis=1)

          A         D         F
0 -1.824406  0.657879  0.102423
1  1.460123  1.084804 -1.210701
2  0.404032  1.003810  0.501174
3 -0.055932  0.811924 -0.766982
4 -0.272806  0.767883 -0.892183

          A         B         D         E         F
0 -1.824406  1.032167  0.657879 -1.222599  0.102423
1  1.460123 -1.495964  1.084804  0.485939 -1.210701
2  0.404032 -0.126057  1.003810 -0.486619  0.501174
3 -0.055932  0.754297  0.811924  0.373838 -0.766982
4 -0.272806 -0.385161  0.767883 -0.448975 -0.892183

In [112]:
#drop with column numbers
df.drop(df.columns[[0, 2]], axis=1, inplace=True)

In [113]:
df

          B         D         E         F
0 -0.731146  1.454015  0.413386 -0.696252
1  0.341173 -0.116793 -0.064043 -0.404365
2  0.475831 -0.182307  0.954442  0.715990
3  0.480710 -1.372161 -0.236672 -2.027064
4 -0.565026  0.161745 -1.054618 -0.287700

In [114]:
### Adding a new column
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

print(df)

   A  B
0  1  4
1  2  5
2  3  6

In [116]:
df['C'] = [7, 8, 9]

In [117]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [118]:
df['D'] = 1

In [119]:
df

   A  B  C  D
0  1  4  7  1
1  2  5  8  1
2  3  6  9  1

In [120]:
df['E'] = df['A'] + df['B']

In [121]:
df

   A  B  C  D  E
0  1  4  7  1  5
1  2  5  8  1  7
2  3  6  9  1  9

In [122]:
###Rename a column

In [123]:
df = pd.DataFrame({'old_name_1': [1, 2, 3], 'old_name_2': [5, 6, 7]})
print(df)

   old_name_1  old_name_2
0           1           5
1           2           6
2           3           7

In [124]:
df.rename(columns={'old_name_1': 'new_name_1', 'old_name_2': 'new_name_2'}, inplace=True)
print(df)

   new_name_1  new_name_2
0           1           5
1           2           6
2           3           7

In [126]:
df.columns = ['new_name_3','new_name_3']
print(df)

   new_name_3  new_name_3
0           1           5
1           2           6
2           3           7

In [128]:
#### Adding a new row to DataFrame
s1 = pd.Series([1,2,3])
s2 = pd.Series(['a','b','c'])

In [129]:
s1

0    1
1    2
2    3
dtype: int64

In [130]:
s2

0    a
1    b
2    c
dtype: object

In [145]:
df = pd.DataFrame([list(s1), list(s2)],  columns =  ["C1", "C2", "C3"])

In [146]:
df

  C1 C2 C3
0  1  2  3
1  a  b  c

In [152]:
df = pd.DataFrame(np.array([[10,11,12]]), \
        columns=["C1", "C2", "C3"]).append(df, ignore_index=True)

In [153]:
df = pd.DataFrame([list(s1)], 
        columns=["C1", "C2", "C3"]).append(df, ignore_index=True)

In [154]:
df

   C1  C2  C3
0   1   2   3
1  10  11  12
2  10  11  12
3   1   2   3
4   a   b   c

In [135]:
print df

   C1  C2  C3
0  10  11  12
1   1   2   3
2   a   b   c

In [157]:
### Delete / drop rows from DataFrame
df = pd.DataFrame(np.arange(10).reshape(5,2), columns=list('ab'))
print(df)

   a  b
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [158]:
df.drop([0,4], inplace=True)

In [159]:
df

   a  b
1  2  3
2  4  5
3  6  7

In [160]:
df = pd.DataFrame(np.arange(10).reshape(5,2), columns=list('ab'))

In [161]:
df

   a  b
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [162]:
df = df.drop([0,4])

In [163]:
df

   a  b
1  2  3
2  4  5
3  6  7

In [164]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [1.0, 2.0, 3.0], 
                           'C': ['1.1.2010', '2.1.2011', '3.1.2011'], 
                           'D': ['1 days', '2 days', '3 days'],
                           'E': ['1', '2', '3']})

In [165]:
df.dtypes

A      int64
B    float64
C     object
D     object
E     object
dtype: object

In [168]:
df['B'].astype('int')

0    1
1    2
2    3
Name: B, dtype: int64

In [167]:
df.dtypes

A      int64
B    float64
C     object
D     object
E     object
dtype: object

In [169]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [1.0, 2.0, 3.0], 'C': ['a', 'b', 'c'], 
                           'D': [True, False, True]})

In [171]:
df

   A    B  C      D
0  1  1.0  a   True
1  2  2.0  b  False
2  3  3.0  c   True

In [ ]:
###select columns based on dtype

In [170]:
df.select_dtypes(include=['number'])

   A    B
0  1  1.0
1  2  2.0
2  3  3.0

In [172]:
df.select_dtypes(include=['number', 'bool'])

   A    B      D
0  1  1.0   True
1  2  2.0  False
2  3  3.0   True

In [176]:
df.select_dtypes(include=['bool','number'], exclude=['int'])

     B      D
0  1.0   True
1  2.0  False
2  3.0   True

#### string-manipulation

In [182]:
ser = pd.Series(['Aribah', 'Analytics', 'Bay area'])

In [183]:
ser

0       Aribah
1    Analytics
2     Bay area
dtype: object

In [184]:
ser.str.upper()

0       ARIBAH
1    ANALYTICS
2     BAY AREA
dtype: object

In [185]:
ser.str.lower()

0       aribah
1    analytics
2     bay area
dtype: object

In [186]:
animals = pd.Series(['cat', 'dog', 'bear', 'cow', 'bird', 'owl', 'rabbit', 'snake'])

In [187]:
animals

0       cat
1       dog
2      bear
3       cow
4      bird
5       owl
6    rabbit
7     snake
dtype: object

In [188]:
animals.str.contains('a')

0     True
1    False
2     True
3    False
4    False
5    False
6     True
7     True
dtype: bool

In [189]:
animals[animals.str.contains('a')]

0       cat
2      bear
6    rabbit
7     snake
dtype: object

In [190]:
animals[animals.str.startswith(('b', 'c'))]

0     cat
2    bear
3     cow
4    bird
dtype: object

In [192]:
ser.str[:3]

0    Ari
1    Ana
2    Bay
dtype: object

In [191]:
ser.str[-1]

0    h
1    s
2    a
dtype: object

#### duplicated-data

In [202]:
df = pd.DataFrame({'A':[1,2,3,3,2,3,2,1,3],'B':[1,7,3,0,8,3,2,1,3]})

In [196]:
df

   A  B
0  1  1
1  2  7
2  3  3
3  3  0
4  2  8
5  3  3
6  2  2
7  1  1
8  3  3

In [200]:
df.drop_duplicates()

   A  B
0  1  1
1  2  7
2  3  3
3  3  0
4  2  8
6  2  2

In [199]:
# keep only the last value
df.drop_duplicates(keep='last')

   A  B
1  2  7
3  3  0
4  2  8
6  2  2
7  1  1
8  3  3

In [203]:
df.drop_duplicates(subset=['A'], keep='last')

   A  B
6  2  2
7  1  1
8  3  3

In [204]:
df.drop_duplicates(subset=['B'], keep='last')

   A  B
1  2  7
3  3  0
4  2  8
6  2  2
7  1  1
8  3  3

#### Missing values
##### dropping-missing

In [205]:
df = pd.DataFrame([[1, 2, None, 3], [4, None, 5, 6], [7, 8, 9, 10], [None, None, None, None]])

In [206]:
df

     0    1    2     3
0  1.0  2.0  NaN   3.0
1  4.0  NaN  5.0   6.0
2  7.0  8.0  9.0  10.0
3  NaN  NaN  NaN   NaN

In [210]:
#Drop rows if at least one column has a missing value
df.dropna()

     0    1    2     3
2  7.0  8.0  9.0  10.0

In [209]:
#Drop rows if all values in that row are missing
df.dropna(how='all')

     0    1    2     3
0  1.0  2.0  NaN   3.0
1  4.0  NaN  5.0   6.0
2  7.0  8.0  9.0  10.0

In [211]:
#Drop columns that don't have at least 3 non-missing values
df.dropna(axis=1, thresh=3)

     0     3
0  1.0   3.0
1  4.0   6.0
2  7.0  10.0
3  NaN   NaN

##### filling-missing-values

In [212]:
df = pd.DataFrame([[1, 2, None, 3], [4, None, 5, 6], [7, 8, 9, 10], [None, None, None, None]])

In [213]:
#Fill missing values with a single value:
df.fillna(0)

     0    1    2     3
0  1.0  2.0  0.0   3.0
1  4.0  0.0  5.0   6.0
2  7.0  8.0  9.0  10.0
3  0.0  0.0  0.0   0.0

In [214]:
#Fill using another DataFrame
df2 = pd.DataFrame(np.arange(100, 116).reshape(4, 4))

In [215]:
df

     0    1    2     3
0  1.0  2.0  NaN   3.0
1  4.0  NaN  5.0   6.0
2  7.0  8.0  9.0  10.0
3  NaN  NaN  NaN   NaN

In [216]:
df2

     0    1    2    3
0  100  101  102  103
1  104  105  106  107
2  108  109  110  111
3  112  113  114  115

In [217]:
df.fillna(df2) #  takes the corresponding cells in df2 to fill df

       0      1      2      3
0    1.0    2.0  102.0    3.0
1    4.0  105.0    5.0    6.0
2    7.0    8.0    9.0   10.0
3  112.0  113.0  114.0  115.0

##### checking-for-missing-values

In [218]:
df = pd.DataFrame({'A': [1, np.nan, 3], 'B': [np.nan, 5, 6]})

In [219]:
print(df)

     A    B
0  1.0  NaN
1  NaN  5.0
2  3.0  6.0

In [220]:
df.isnull()  # If the value is NaN, returns True.

       A      B
0  False   True
1   True  False
2  False  False

In [221]:
df.notnull()  # Opposite of .isnull(). If the value is not NaN, returns True.

       A      B
0   True  False
1  False   True
2   True   True

### Reshaping and pivoting
A pivot table is a program tool that allows you to reorganize and summarize selected columns and rows of data in a spreadsheet or database table to obtain a desired report. A pivot table doesn't actually change the spreadsheet or database itself.

In [223]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'Name':['Mary', 'Jon','Lucy', 'Jane', 'Sue', 'Mary', 'Lucy'],
                   'Age':[35, 37, 40, 29, 31, 26, 28],
                   'City':['Boston', 'Chicago', 'Los Angeles', 'Chicago', 'Boston', 'Boston', 'Chicago'],
                   'Position':['Manager','Manager','Manager','Programmer', 'Programmer','Manager','Manager'],
                    'Sex':['Female','Male','Female','Female', 'Female','Female','Female']},
                    columns=['Name','Position','City','Age','Sex'])

In [225]:
df

   Name    Position         City  Age     Sex
0  Mary     Manager       Boston   35  Female
1   Jon     Manager      Chicago   37    Male
2  Lucy     Manager  Los Angeles   40  Female
3  Jane  Programmer      Chicago   29  Female
4   Sue  Programmer       Boston   31  Female
5  Mary     Manager       Boston   26  Female
6  Lucy     Manager      Chicago   28  Female

In [227]:
df.pivot_table(index='Position', columns='City', values='Age')

City        Boston  Chicago  Los Angeles
Position
Manager       30.5     32.5         40.0
Programmer    31.0     29.0          NaN

In [228]:
df.pivot_table(index='Position', columns='City', values='Age', aggfunc=np.mean)

City        Boston  Chicago  Los Angeles
Position
Manager       30.5     32.5         40.0
Programmer    31.0     29.0          NaN

In [229]:
df.pivot_table(index='Position', columns='City', values='Age', aggfunc=sum)

City        Boston  Chicago  Los Angeles
Position
Manager       61.0     65.0         40.0
Programmer    31.0     29.0          NaN

In [233]:
df.pivot_table(index='Position', columns='City', values='Name', aggfunc='first')

City       Boston Chicago Los Angeles
Position
Manager      Mary     Jon        Lucy
Programmer    Sue    Jane        None

In [234]:
df.pivot_table(index='Position', columns='City', values='Name', aggfunc='last')

City       Boston Chicago Los Angeles
Position
Manager      Mary    Lucy        Lucy
Programmer    Sue    Jane        None

In [235]:
df.pivot_table(index='Position', columns='City', values='Name', aggfunc='sum')

City          Boston  Chicago Los Angeles
Position
Manager     MaryMary  JonLucy        Lucy
Programmer       Sue     Jane        None

In [237]:
df.pivot_table(index='Position', columns=['City','Sex'], values='Age', aggfunc='first')

City       Boston Chicago       Los Angeles
Sex        Female  Female  Male      Female
Position
Manager      35.0    28.0  37.0        40.0
Programmer   31.0    29.0   NaN         NaN

In [238]:
df.pivot_table(index='Position', values='Age', aggfunc=[np.mean, np.std])

            mean       std
Position
Manager     33.2  5.974948
Programmer  30.0  1.414214

#### Stacking and unstacking


Similar to the pivot function are the .stack() and .unstack() methods. The process of stacking pivots a level of column labels to the row index. Unstacking performs the opposite, that is, pivoting a level of the row index into the column index.

One of the differences between stacking/unstacking and performing a pivot is that unlike pivots, the stack and unstack functions are able to pivot specific levels of a hierarchical index. Also, where a pivot retains the same number of levels on an index, a stack and unstack always increases the levels on the index of one of the axes (columns for unstacking and rows for stacking) and decrease the levels on the other axis.

In [241]:
df = pd.DataFrame({'a': [1, 2]}, index={'one', 'two'})

In [242]:
df

     a
two  1
one  2

In [243]:
stacked1 = df.stack()

In [244]:
stacked1

two  a    1
one  a    2
dtype: int64

In [245]:
stacked1[('one', 'a')]

2

In [246]:
df = pd.DataFrame({'a': [1, 2],
 'b': [3, 4]},
 index={'one', 'two'})

In [247]:
df

     a  b
two  1  3
one  2  4

In [248]:
stacked2 = df.stack()

In [250]:
stacked2

two  a    1
     b    3
one  a    2
     b    4
dtype: int64

In [251]:
 stacked2[('one', 'b')]

4

In [254]:
#unstack
stacked2.unstack()

     a  b
two  1  3
one  2  4

### cross-tabulation

In [255]:
import pandas as pd
df = pd.DataFrame({'Sex': ['M', 'M', 'F', 'M', 'F', 'F', 'M', 'M', 'F', 'F'], 
               'Age': [20, 19, 17, 35, 22, 22, 12, 15, 17, 22],
               'Heart Disease': ['Y', 'N', 'Y', 'N', 'N', 'Y', 'N', 'Y', 'N', 'Y']})

In [256]:
df

   Age Heart Disease Sex
0   20             Y   M
1   19             N   M
2   17             Y   F
3   35             N   M
4   22             N   F
5   22             Y   F
6   12             N   M
7   15             Y   M
8   17             N   F
9   22             Y   F

In [257]:
pd.crosstab(df['Sex'], df['Heart Disease'])

Heart Disease  N  Y
Sex
F              2  3
M              3  2

In [259]:
#Using dot notation:
pd.crosstab(df.Sex, df.Age)

Age  12  15  17  19  20  22  35
Sex
F     0   0   2   0   0   3   0
M     1   1   0   1   1   0   1

In [260]:
#Getting margins or cumulatives:
pd.crosstab(df['Sex'], df['Heart Disease'], margins=True)

Heart Disease  N  Y  All
Sex
F              2  3    5
M              3  2    5
All            5  5   10

In [261]:
#Getting percentages :
pd.crosstab(df["Sex"],df['Heart Disease']).apply(lambda r: r/len(df), axis=1)

Heart Disease    N    Y
Sex
F              0.2  0.3
M              0.3  0.2

In [262]:
pd.crosstab(df["Age"],df['Sex'], margins=True ).apply(lambda r: r/len(df)*100, axis=1)

Sex     F     M    All
Age
12    0.0  10.0   10.0
15    0.0  10.0   10.0
17   20.0   0.0   20.0
19    0.0  10.0   10.0
20    0.0  10.0   10.0
22   30.0   0.0   30.0
35    0.0  10.0   10.0
All  50.0  50.0  100.0

In [265]:
df = pd.DataFrame({'Name':['Mary', 'Josh','Jon','Lucy', 'Jane', 'Sue'],
                   'Age':[34, 37, 29, 40, 29, 31],
                   'City':['Boston','New York', 'Chicago', 'Los Angeles', 'Chicago', 'Boston'],
                   'Position':['Manager','Programmer','Manager','Manager','Programmer', 'Programmer']},
                    columns=['Name','Position','City','Age'])

In [266]:
df

   Name    Position         City  Age
0  Mary     Manager       Boston   34
1  Josh  Programmer     New York   37
2   Jon     Manager      Chicago   29
3  Lucy     Manager  Los Angeles   40
4  Jane  Programmer      Chicago   29
5   Sue  Programmer       Boston   31

In [267]:
df.pivot(index='Position', columns='City', values='Age')

City        Boston  Chicago  Los Angeles  New York
Position
Manager       34.0     29.0         40.0       NaN
Programmer    31.0     29.0          NaN      37.0

In [271]:
df1 = pd.DataFrame({'x': [1, 2, 3], 'y': ['a', 'b', 'c']})

In [272]:
df1

   x  y
0  1  a
1  2  b
2  3  c

In [273]:
df2 = pd.DataFrame({'y': ['b', 'c', 'd'], 'z': [4, 5, 6]})

In [274]:
df2

   y  z
0  b  4
1  c  5
2  d  6

In [275]:
df1.merge(df2) # by default, it does an inner join on the common column(s)

   x  y  z
0  2  b  4
1  3  c  5

In [276]:
df1.merge(df2, how='outer')

     x  y    z
0  1.0  a  NaN
1  2.0  b  4.0
2  3.0  c  5.0
3  NaN  d  6.0

In [277]:
df1.merge(df2, how='left')

   x  y    z
0  1  a  NaN
1  2  b  4.0
2  3  c  5.0

In [278]:
df1.merge(df2, how='right')

     x  y  z
0  2.0  b  4
1  3.0  c  5
2  NaN  d  6

#### Difference-between-join-and-merge

In [279]:
left = pd.DataFrame([['a', 1], ['b', 2]], list('XY'), list('AB'))
left

   A  B
X  a  1
Y  b  2

In [280]:
right = pd.DataFrame([['a', 3], ['b', 4]], list('XY'), list('AC'))
right

   A  C
X  a  3
Y  b  4

In [284]:
# If there are overlapping columns, 
#join will want you to add a suffix to the overlapping column name from left dataframe.
left.join(right, lsuffix='_')

  A_  B  A  C
X  a  1  a  3
Y  b  2  b  4

In [287]:
left.join(right, rsuffix='_', how='outer')

   A  B A_  C
X  a  1  a  3
Y  b  2  b  4

In [3]:
df1 = pd.DataFrame({'col1':[11,12,13], 'col2': [21,22,23]})

In [4]:
df1

   col1  col2
0    11    21
1    12    22
2    13    23

In [5]:
df2 = pd.DataFrame({'col1':[111,112,113], 'col2': [121,122,123]})

In [6]:
df2

   col1  col2
0   111   121
1   112   122
2   113   123

In [7]:
df3 = pd.DataFrame({'col1':[211,212,213], 'col2': [221,222,223]})

In [8]:
df3

   col1  col2
0   211   221
1   212   222
2   213   223

In [10]:
#merge / join / concatenate data frames [df1, df2, df3] vertically - add rows
pd.concat([df1,df2,df3], ignore_index=True)

   col1  col2
0    11    21
1    12    22
2    13    23
3   111   121
4   112   122
5   113   123
6   211   221
7   212   222
8   213   223

In [11]:
#merge / join / concatenate data frames [df1, df2, df3] vertically - add rows
pd.concat([df1,df2,df3], axis=1)

   col1  col2  col1  col2  col1  col2
0    11    21   111   121   211   221
1    12    22   112   122   212   222
2    13    23   113   123   213   223

### Apply function in pandas

In [8]:
df = pd.read_csv("data/people-example.csv")

In [9]:
df['age']

0    24
1    23
2    22
3    23
4    23
5    22
6    25
Name: age, dtype: int64

In [10]:
df['age'].mean()

23.142857142857142

In [11]:
df['age'].max()

25

In [12]:
df[df['age'] >= 24]

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
6      Derek      Ward    Switzerland   25

In [17]:
df['Full Name'] = df['First Name'] + ' ' + df['Last Name']

In [18]:
df['age'] * df['age']

0    576
1    529
2    484
3    529
4    529
5    484
6    625
Name: age, dtype: int64

In [19]:
def transform_country(country):
    if country == 'USA':
        return 'United States'
    else:
        return country

In [20]:
transform_country('Brazil')

'Brazil'

In [21]:
transform_country('USA')

'United States'

In [22]:
df['Country'] =  df['Country'].apply(transform_country)

In [23]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown  United States   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

### Understanding kaggle's titanic dataset 
https://www.kaggle.com/c/titanic/data

In [29]:
titanic_df = pd.read_csv('data/titanic_train.csv')

In [25]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
titanic_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [27]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [30]:
titanic_df2 = titanic_df

In [28]:
titanic_df['Embarked'].head()

0    S
1    C
2    S
3    S
4    S
Name: Embarked, dtype: object

In [15]:
titanic_df[['Survived','Embarked']][:10]

   Survived Embarked
0         0        S
1         1        C
2         1        S
3         1        S
4         0        S
5         0        Q
6         0        S
7         0        S
8         1        S
9         1        C

In [16]:
titanic_df[['Survived','Embarked']][:10]

   Survived Embarked
0         0        S
1         1        C
2         1        S
3         1        S
4         0        S
5         0        Q
6         0        S
7         0        S
8         1        S
9         1        C

In [25]:
titanic_df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [26]:
titanic_df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [27]:
titanic_df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [19]:
titanic_df_male = titanic_df[titanic_df['Sex'] == "male"]

In [20]:
titanic_df_male.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [51]:
len(titanic_df_male)

577

In [28]:
titanic_df_male['Sex'].unique()

array(['male'], dtype=object)

In [29]:
male = titanic_df['Sex'] == "male"

In [32]:
male[:5]

0     True
1    False
2    False
3    False
4     True
Name: Sex, dtype: bool

In [33]:
embarked_s = titanic_df['Embarked'] == "S"

In [34]:
embarked_s[:5]

0     True
1    False
2     True
3     True
4     True
Name: Embarked, dtype: bool

In [35]:
titanic_df[embarked_s & male][:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S

In [36]:
titanic_df[embarked_s & male][['PassengerId','Pclass','Sex','SibSp','Embarked']][:5]

    PassengerId  Pclass   Sex  SibSp Embarked
0             1       3  male      1        S
4             5       3  male      0        S
6             7       1  male      0        S
7             8       3  male      3        S
12           13       3  male      0        S

In [37]:
above_50_df = titanic_df[titanic_df['Age'] > 50]

In [38]:
above_50_df['Age'][:5]

6     54.0
11    58.0
15    55.0
33    66.0
54    65.0
Name: Age, dtype: float64

In [39]:
len(above_50_df)

64

In [44]:
age_30_50 = titanic_df[(titanic_df['Age'] > 30) & (titanic_df['Age'] < 50)]

In [45]:
len(age_30_50)

231

In [47]:
age_30_50_q = titanic_df.query('Age > 30 and Age < 50')

In [48]:
len(age_30_50_q)

231

In [65]:
titanic_df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [66]:
titanic_df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [67]:
titanic_df['Embarked'] = titanic_df['Embarked'].fillna("S")

In [68]:
titanic_df['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [69]:
titanic_df['Age'].isnull().value_counts()

False    714
True     177
Name: Age, dtype: int64

In [70]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())

In [71]:
titanic_df['Age'].isnull().value_counts()

False    891
Name: Age, dtype: int64

In [72]:
titanic_df.columns[titanic_df.isnull().any()].tolist()

['Cabin']

In [73]:
titanic_df['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6', 'C23 C25 C27',
       'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33', 'F G73', 'E31',
       'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101', 'F E69', 'D47',
       'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4', 'A32', 'B4',
       'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35', 'C87', 'B77',
       'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19', 'B49', 'D',
       'C22 C26', 'C106', 'C65', 'E36', 'C54', 'B57 B59 B63 B66', 'C7',
       'E34', 'C32', 'B18', 'C124', 'C91', 'E40', 'T', 'C128', 'D37',
       'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44', 'A34', 'C104', 'C111',
       'C92', 'E38', 'D21', 'E12', 'E63', 'A14', 'B37', 'C30', 'D20',
       'B79', 'E25', 'D46', 'B73', 'C95', 'B38', 'B39', 'B22', 'C86',
       'C70', 'A16', 'C101', 'C68', 'A10', 'E68', 'B41', 'A20', 'D19',
       'D50', 'D9', 'A23', 'B50', 'A26', 'D48', 'E58', 'C126', 'B71',
       'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63', 'C62 C64', 'E24', 'C90',
       'C45', 'E8', 'B101', 'D45', 'C46', 'D30', 'E121', 'D11', 'E77',
       'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36', 'B102', 'B69', 'E49',
       'C47', 'D28', 'E17', 'A24', 'C50', 'B42', 'C148'], dtype=object)

In [74]:
len(titanic_df['Cabin'].unique())

148

In [75]:
titanic_df=titanic_df.dropna(how='any')

In [177]:
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.000000,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.000000,0,0,113783,26.5500,C103,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.000000,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.000000,0,0,113788,35.5000,A6,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.000000,3,2,19950,263.0000,C23 C25 C27,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,29.699118,1,0,PC 17569,146.5208,B78,C
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.000000,1,0,PC 17572,76.7292,D33,C
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.000000,0,1,113509,61.9792,B30,C
55,56,1,1,"Woolner, Mr. Hugh",male,29.699118,0,0,19947,35.5000,C52,S
61,62,1,1,"Icard, Miss. Amelie",female,38.000000,0,0,113572,80.0000,B28,S
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.000000,1,0,36973,83.4750,C83,S
66,67,1,2,"Nye, Mrs. (Elizabeth Ramell)",female,29.000000,0,0,C.A. 29395,10.5000,F33,S
75,76,0,3,"Moen, Mr. Sigurd Hansen",male,25.000000,0,0,348123,7.6500,F G73,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.000000,3,2,19950,263.0000,C23 C25 C27,S
92,93,0,1,"Chaffee, Mr. Herbert Fuller",male,46.000000,1,0,W.E.P. 5734,61.1750,E31,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.000000,0,0,PC 17754,34.6542,A5,C
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.000000,0,1,PC 17759,63.3583,D10 D12,C
102,103,0,1,"White, Mr. Richard Frasar",male,21.000000,0,1,35281,77.2875,D26,S
110,111,0,1,"Porter, Mr. Walter Chamberlain",male,47.000000,0,0,110465,52.0000,C110,S
118,119,0,1,"Baxter, Mr. Quigg Edmond",male,24.000000,0,1,PC 17558,247.5208,B58 B60,C
123,124,1,2,"Webber, Miss. Susan",female,32.500000,0,0,27267,13.0000,E101,S
124,125,0,1,"White, Mr. Percival Wayland",male,54.000000,0,1,35281,77.2875,D26,S
128,129,1,3,"Peter, Miss. Anna",female,29.699118,1,1,2668,22.3583,F E69,C
136,137,1,1,"Newsom, Miss. Helen Monypeny",female,19.000000,0,2,11752,26.2833,D47,S
137,138,0,1,"Futrelle, Mr. Jacques Heath",male,37.000000,1,0,113803,53.1000,C123,S
139,140,0,1,"Giglio, Mr. Victor",male,24.000000,0,0,PC 17593,79.2000,B86,C
148,149,0,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.500000,0,2,230080,26.0000,F2,S
...,...,...,...,...,...,...,...,...,...,...,...,...
751,752,1,3,"Moor, Master. Meier",male,6.000000,0,1,392096,12.4750,E121,S
759,760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.000000,0,0,110152,86.5000,B77,S
763,764,1,1,"Carter, Mrs. William Ernest (Lucile Polk)",female,36.000000,1,2,113760,120.0000,B96 B98,S
765,766,1,1,"Hogeboom, Mrs. John C (Anna Andrews)",female,51.000000,1,0,13502,77.9583,D11,S
772,773,0,2,"Mack, Mrs. (Mary)",female,57.000000,0,0,S.O./P.P. 3,10.5000,E77,S
776,777,0,3,"Tobin, Mr. Roger",male,29.699118,0,0,383121,7.7500,F38,Q
779,780,1,1,"Robert, Mrs. Edward Scott (Elisabeth Walton Mc...",female,43.000000,0,1,24160,211.3375,B3,S
781,782,1,1,"Dick, Mrs. Albert Adrian (Vera Gillespie)",female,17.000000,1,0,17474,57.0000,B20,S
782,783,0,1,"Long, Mr. Milton Clyde",male,29.000000,0,0,113501,30.0000,D6,S
789,790,0,1,"Guggenheim, Mr. Benjamin",male,46.000000,0,0,PC 17593,79.2000,B82 B84,C
796,797,1,1,"Leader, Dr. Alice (Farnham)",female,49.000000,0,0,17465,25.9292,D17,S
802,803,1,1,"Carter, Master. William Thornton II",male,11.000000,1,2,113760,120.0000,B96 B98,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.000000,0,0,112050,0.0000,A36,S
809,810,1,1,"Chambers, Mrs. Norman Campbell (Bertha Griggs)",female,33.000000,1,0,113806,53.1000,E8,S
815,816,0,1,"Fry, Mr. Richard",male,29.699118,0,0,112058,0.0000,B102,S
820,821,1,1,"Hays, Mrs. Charles Melville (Clara Jennings Gr...",female,52.000000,1,1,12749,93.5000,B69,S
823,824,1,3,"Moor, Mrs. (Beila)",female,27.000000,0,1,392096,12.4750,E121,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.000000,0,0,113572,80.0000,B28,S
835,836,1,1,"Compton, Miss. Sara Rebecca",female,39.000000,1,1,PC 17756,83.1583,E49,C
839,840,1,1,"Marechal, Mr. Pierre",male,29.699118,0,0,11774,29.7000,C47,C
849,850,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,29.699118,1,0,17453,89.1042,C92,C
853,854,1,1,"Lines, Miss. Mary Conover",female,16.000000,0,1,PC 17592,39.4000,D28,S
857,858,1,1,"Daly, Mr. Peter Denis",male,51.000000,0,0,113055,26.5500,E17,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.000000,0,0,17466,25.9292,D17,S
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.000000,0,0,PC 17590,50.4958,A24,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.000000,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.000000,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.000000,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C

In [76]:
len(titanic_df['Cabin'].unique())

147

In [31]:
titanic_df2.columns[titanic_df.isnull().any()].tolist()

['Age', 'Cabin', 'Embarked']

In [32]:
len(titanic_df2)

891

In [33]:
titanic_df_2_drop_all = titanic_df2.dropna(how='any')

In [34]:
len(titanic_df_2_drop_all)

183

In [36]:
titanic_df2['Age'].isnull().value_counts()

False    714
True     177
Name: Age, dtype: int64

In [37]:
titanic_df_2_age = titanic_df2.dropna(subset=['Age'])

In [38]:
len(titanic_df_2_age)

714

In [39]:
titanic_df_2_age['Age'].isnull().value_counts()

False    714
Name: Age, dtype: int64

In [40]:
titanic_df_2_age_cabin = titanic_df_2_age.dropna(subset=['Age','Cabin',])

In [41]:
len(titanic_df_2_age_cabin)

185